"""
进程和线程的概念
进程：cpu资源分配的最小单位
线程：cpu调度的最小单位
进程和线程的关系：
1.一个进程至少有一个线程，主线程
2.一个线程只能属于一个进程
3.一个进程可以有多个线程，子线程    
也就是先分配进程，再分配线程，即先分配资源，再进行调度
辨别：程序与进程
程序：一段静态的代码，存储在磁盘上
        进程：程序的一次动态执行过程，存在于内存中  
        一个程序可以同时运行多个进程，例如打开多个浏览器窗口，每个窗口就是一个进程
        一个进程可以包含多个线程，例如在浏览器中，主线程负责界面显示，子线程负责下载资源
        打白话：程序是菜谱，进程是厨师在厨房里根据菜谱做菜的过程，线程是厨师同时进行的多个步骤，例如切菜、炒菜、装盘等

    进程和函数的关系：
        函数：一段具有特定功能的代码块，可以被调用执行
        进程：函数的一次动态执行过程，存在于内存中 
        函数是进程的组成部分，进程通过调用函数来完成特定的任务
        打白话：函数是菜谱中的一个步骤，例如切菜、炒菜等，
        进程是厨师在厨房里根据菜谱做菜的过程，函数是厨师在做菜过程中执行的具体步骤   
"""
"""
内存布局：

内存区域        存放内容                            
代码段          程序指令(可执行代码段)
数据段          全局变量，局部变量
堆              动态分布的内存
栈              局部变量，函数调用帧，返回地址

"""