"""
闭包：内部函数使用了外部函数的变量，这种写法叫闭包
    格式：
        define 外部函数名(形参)：
            外部函数(局部)变量

            def 内部函数名(形参)：
                内部函数变量
            
            return 内部函数名
    作用：保存函数变量(外部函数变量 )
ps:函数名与函数名()是不同的东西，前者是函数对象，后者是调用函数，获取返回值    

    构成条件：1.有嵌套：函数嵌套(函数里面定义函数)的前提
             2.有引用：内部函数引用外部函数变量(包括外部函数参数名)
             3.有返回：外部函数返回内部函数名
"""

#案例 函数名是对象
def add(a,b):
    return a+b
print(add)



#案例 闭包
def add1(num1):
    def add2(num2):
        sum=num1+num2
        print(f'输出结果：{sum}')
    return  add2

add2=add1(10)
result=add2(20)
print(result)
add1(100)(200)
