"""
装饰器：本质还是闭包
    作用：在不改变原有函数的基础上，给原函数增加功能
    条件:1.有嵌套
        2有引用
        3.有返回
        4.有额外功能
    用法：
        格式1:传统写法:
            装饰后函数名 = 装饰器名(被装饰原函数名) 感觉像给被装饰函数加上装饰器的功能
            装饰后函数名()

        格式2:语法糖
            在要被装饰的原函数上，直接写@装饰器名，之后调用原函数
"""

#需求：发表评论前需要先登
#外部函数
def outer(fn_name):#fn_name代表接收的是一个函数对象

    def inner():
        #1.1额外功能
        print("校验登录中")
        #1.2访问原函数
        fn_name()
    return inner

def comment():
    print("发表评论")


@outer
def payment():
    print("充值成功")

#
#3.1传统写法
c = outer(comment)
c()
print("-"*23)

#3.2语法糖
payment()
    