"""
不可变对象:创建后不可修改的对象，包括；字符串，元组，数值(int,float)
解释：创建对象时，内存划分空间，并给地址，无法在该空间内对里面的值修改，改变某个变量时，实际是开辟了新的空间，变量指向新地址
可变对象：可以修改对象：list，dict,集合
解释：地址不变的条件下能够对里面的值进行修改

深浅拷贝：
    1.深浅拷贝分别指：
        copy模块的copy()
        copy模块的deepcopy()
    2.解释：
        深拷贝拷的多，浅拷贝拷的少(可以从指针视角理解)
    3.实质：浅拷贝是开辟新空间复制第一层元素的地址，深拷贝是开辟新空间复制所有元素的值
            浅拷贝拷贝拷贝的是地址，后续指向也是地址
            深拷贝拷贝的是值，它指向的是自己新空间的地址，所以修改与它无关
    3.二者主要针对可变类型：深拷贝拷贝所有层(可变)，浅的拷贝第一层(可变)
    4.浅拷贝和深拷贝面对不可变对象时没有区别，同普通赋值一样，普通赋值不开辟新空间，直接指向原地址，
        浅拷贝和深拷贝不开辟新空间，指向该地址，当我们修改不可变对象时，都会开辟新空间，指向新地址，
        所以无论是浅拷贝还是深拷贝，修改不可变对象时都不会影响原对象，深浅拷贝此时还是输出原值，而赋值输出新值
    
"""



import copy

#浅拷贝演示
# a = [1, 2, 3]
# b = [11, 22, 33]
# c = [6,7,a, b]

# #测试
# d=copy.copy(c)
# print('id(c):',id(c))   #0x03
# print('id(d):',id(d))   #0x04  开辟新空间复制c中第一层元素的地址，而非c整体地址
# a[0] = 100  #修改a中元素的值,可变对象改变地址不变，所有d中a的地址不变，值改变
# print('c:',c)   
# print('d:',d)   

# c[1] = 999  #修改c中元素的值,不可变对象改变地址，指向新的值，d中地址不变，值不变
# print('c:',c)
# print('d:',d)


#深拷贝演示
a = [1, 2, 3]
b = [11, 22, 33]
c = [6,7,a, b]
d = copy.deepcopy(c)
print('id(c):',id(c))   #0x03       
print('id(d):',id(d))   #0x04 开辟新空间复制拷贝所有的元素，而非地址，并在新空间内用新的地址指向值，简单说就是开新空间复制所有元素的值
                            #所以更改c中元素的值，与深拷贝无关，深拷贝指向的是新空间的地址
a[1] = 100  
b[1] = 200 
print('c:',c)   
print('d:',d)  
